bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/edc/ATSAMC21N18A.PIC
      <edc:SFRDef edc:_addr="0x4200209C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NDAT2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="ND32" edc:desc="New Data 32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND33" edc:desc="New Data 33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND34" edc:desc="New Data 34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND35" edc:desc="New Data 35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND36" edc:desc="New Data 36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND37" edc:desc="New Data 37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND38" edc:desc="New Data 38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND39" edc:desc="New Data 39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND40" edc:desc="New Data 40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND41" edc:desc="New Data 41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND42" edc:desc="New Data 42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND43" edc:desc="New Data 43" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND44" edc:desc="New Data 44" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND45" edc:desc="New Data 45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND46" edc:desc="New Data 46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND47" edc:desc="New Data 47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND48" edc:desc="New Data 48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND49" edc:desc="New Data 49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND50" edc:desc="New Data 50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND51" edc:desc="New Data 51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND52" edc:desc="New Data 52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND53" edc:desc="New Data 53" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND54" edc:desc="New Data 54" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND55" edc:desc="New Data 55" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND56" edc:desc="New Data 56" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND57" edc:desc="New Data 57" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND58" edc:desc="New Data 58" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND59" edc:desc="New Data 59" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND60" edc:desc="New Data 60" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND61" edc:desc="New Data 61" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND62" edc:desc="New Data 62" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND63" edc:desc="New Data 63" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420020A0" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RXF0C" edc:impl="0xFF7FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F0SA" edc:desc="Rx FIFO 0 Start Address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="F0S" edc:desc="Rx FIFO 0 Size" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0WM" edc:desc="Rx FIFO 0 Watermark" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="F0OM" edc:desc="FIFO 0 Operation Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420020A4" edc:access="------rr--rrrrrr--rrrrrr-rrrrrrr" edc:cname="RXF0S" edc:impl="0x33F3F7F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F0FL" edc:desc="Rx FIFO 0 Fill Level" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0GI" edc:desc="Rx FIFO 0 Get Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0PI" edc:desc="Rx FIFO 0 Put Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0F" edc:desc="Rx FIFO 0 Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:desc="Rx FIFO 0 Message Lost" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420020A8" edc:access="--------------------------nnnnnn" edc:cname="RXF0A" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F0AI" edc:desc="Rx FIFO 0 Acknowledge Index" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420020AC" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="RXBC" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="RBSA" edc:desc="Rx Buffer Start Address" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420020B0" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RXF1C" edc:impl="0xFF7FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F1SA" edc:desc="Rx FIFO 1 Start Address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="F1S" edc:desc="Rx FIFO 1 Size" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1WM" edc:desc="Rx FIFO 1 Watermark" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="F1OM" edc:desc="FIFO 1 Operation Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420020B4" edc:access="rr----rr--rrrrrr--rrrrrr-rrrrrrr" edc:cname="RXF1S" edc:impl="0xC33F3F7F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F1FL" edc:desc="Rx FIFO 1 Fill Level" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1GI" edc:desc="Rx FIFO 1 Get Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1PI" edc:desc="Rx FIFO 1 Put Index" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1F" edc:desc="Rx FIFO 1 Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:desc="Rx FIFO 1 Message Lost" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DMS" edc:desc="Debug Message Status" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Idle state" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DBGA" edc:desc="Debug message A received" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DBGB" edc:desc="Debug message A/B received" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DBGC" edc:desc="Debug message A/B/C received, DMA request set" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420020B8" edc:access="--------------------------nnnnnn" edc:cname="RXF1A" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F1AI" edc:desc="Rx FIFO 1 Acknowledge Index" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420020BC" edc:access="---------------------nnn-nnn-nnn" edc:cname="RXESC" edc:impl="0x777" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F0DS" edc:desc="Rx FIFO 0 Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1DS" edc:desc="Rx FIFO 1 Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RBDS" edc:desc="Rx Buffer Data Field Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DATA8" edc:desc="8 byte data field" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA12" edc:desc="12 byte data field" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DATA16" edc:desc="16 byte data field" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DATA20" edc:desc="20 byte data field" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DATA24" edc:desc="24 byte data field" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DATA32" edc:desc="32 byte data field" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DATA48" edc:desc="48 byte data field" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DATA64" edc:desc="64 byte data field" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420020C0" edc:access="-nnnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:cname="TXBC" edc:impl="0x7F3FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TBSA" edc:desc="Tx Buffers Start Address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="NDTB" edc:desc="Number of Dedicated Transmit Buffers" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TFQS" edc:desc="Transmit FIFO/Queue Size" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="TFQM" edc:desc="Tx FIFO/Queue Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420020C4" edc:access="----------rrrrrr---rrrrr--rrrrrr" edc:cname="TXFQS" edc:impl="0x3F1F3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TFFL" edc:desc="Tx FIFO Free Level" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TFGI" edc:desc="Tx FIFO Get Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TFQPI" edc:desc="Tx FIFO/Queue Put Index" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TFQF" edc:desc="Tx FIFO/Queue Full" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
